[
  {
    "text": "<@U02TV7DPGBG> continuing discussion here from the govbase thread\n\nthe way RIDs work is fairly agnostic towards different file types, you can reference anything if you can come up with a way of representing it, regardless of how the actual data is stored or retrieved. In practice there are some considerations that have to be made, in the case of data like a video recording, it would need to be converted to a text format to be used in a lot of the subsystems within KOI. For example, the vector embedding system we use only works with text data, so we couldn't natively embed images, audio, video, etc. but could send them to a transcriber or have an AI describe what it sees in text to provide a version of the data compatible with parts of the system. However it's also perfectly fine to just have a video that is RIDed and can only be used in the most basic ways, where the system knows it exists and can link to it but can't do it anything more complex with it.",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1718160412110899"
  },
  {
    "text": "Is the koimunnity cove still going ahead this week? I didn’t see any announcement/notification for it. <@U02TV7DPGBG> ",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1718144317629989"
  },
  {
    "text": "Nearly finished the first draft of the <https://docs.google.com/document/d/1h6aop40RvrUoruI4qoX0fAA9qA11AJ0CELv3T016n60/edit|KOI Newsletter>! Please feel free to revise and edit the draft as needed.",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1717583141346729"
  },
  {
    "text": "LLM running and pulling knowledge from KOI!",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1717491070236099"
  },
  {
    "text": "first knowledge observation using the new API!",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1717477274313169"
  },
  {
    "text": "Microsoft application submitted. I upped the software engineering hours to 550. Updated on google doc too.",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1717369496057909"
  },
  {
    "text": "I focused on the provenance attribution question because this is easier to test for and write a  report on within a small grant such as this (&lt;50k). We can reserve the bigger questions for bigger funding opportunities. As per RJ's advice, we want to keep our specific asks distinct while having an overall concept note that we can shop around and adapt as funding opportunities arise. Zargham and I have made a start on the concept note and will share that soon.",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1717038014544189"
  },
  {
    "text": "Posted this already in govbase channel as hoping to nab some time during this week's call to discuss, but posting here too in case some people here not checking that channel. My draft of Microsoft Future Work grant draft application: <https://docs.google.com/document/d/1LqiyjSxCJBWeoVLqBEU4wKni0KKceAGOdf82PA84VnQ/edit>",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1717037234684749"
  },
  {
    "text": "I’m happy with Z’s edits. I made some changes as per Brooke’s comments too",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1715903825993649"
  },
  {
    "text": "Thanks <@U01672057BN> !",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1715903448949799"
  },
  {
    "text": "per the <#C0175M3GLSU|govbase-labs> call conversation about getting the project details online, I ended up just sitting down and run through the whole doc now -- i made few changes with track changes on and flagged them to <@U01672057BN> to sign off on / accept. Assuming Ellie is comfortable accepting my edits. its good to go on my end.",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1715899727584489"
  },
  {
    "text": "Quick update here about my timeline since I had previously mentioned some constraints on my end. Just finished up my last set of finals before graduation (yay!) so I won't have any updates today, but I will still be at the govbase call. I've shifted around my Summer plans, so I won't be out following graduation anymore. I will be leaving for Shanghai on May 29th and staying there for 6 weeks, so I will be 12 hours off of Eastern time until mid-July. And then after I get back I will probably need to take 2 weeks off for surgery recovery from July 18 until the end of the month.",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1715282089642359"
  },
  {
    "text": "Quick question. Is there a plan yet for launching / announcing koi pond to the rest of Metagov?",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1715261242919579"
  },
  {
    "text": "one result of switching to this language is an invitation to be always improving on the margins that matter",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1715260067480089"
  },
  {
    "text": "it looks great overall, the one tweak i would make is\n&gt; • *to what extent* a community's priorities can be reflected in the rules, sorting and boundaries that define our KOI, and\n&gt; • *to what extent* this produces a useful technology/infrastructure capable of propagating knowledge flowing through and from Metagov\nthe previous version said \"whether\" which implies a binary yes/no outcome. in my experience this is a false dichotomy, its always a question of which aspects are well captured and which are not, on which margins its useful and for which is it not. By moving from \"whether\" to \"to what extent\" we can remove the implicit binary and open of the questions to varied answers.",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1715260020585939"
  },
  {
    "text": "I filled in more complete responses in the <https://docs.google.com/document/d/1yi3sOITv8BvgdDxvziOXJK0sJEPQyeTppJAKCB70aTg/edit|KOI FAQ doc>. It would be useful for others to review, comment, and/or edit the responses before publishing them to the project page.",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1715249669960879"
  },
  {
    "text": "<@U01G7NSR78S> This my conceptual model for how the different components of the KOI fit together. Could you have a look and correct any mistakes/add elements I may have missed?",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1715072505569829"
  },
  {
    "text": "Circling back to <@U04SDK8LGUX>'s FAQ, I have suggested changing 'goal' to 'objectives' and listed the following:\n*What are the objectives is the goal of this project?*\n\n*The objectives are to:* \n1. Develop technical components that enable Metagov to deploy the KOI architecture (first developed by BlockScience) in a way that meets our particular needs and priorities\n2. Design processes, including governance tools, that provide Metagov community members with agency over knowledge management and use\n3. Conduct comparative analysis of cross-organization knowledge infrastructures and their constitutive processes (as defined here [<https://blog.block.science/what-constitutes-a-constitution/>).\n4. Communicate our research and experiences so that other organisations can learn from our KOI experiment\n",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1714699808105779"
  },
  {
    "text": "Yes, this looks great. My only comment is that the team list seems a bit short seeing as you <@U02TV7DPGBG>, <@U0319V81YGY> and <@U06LVP5NMHT> have been participating in the weekly calls and the thinking that has got us to here? <@U017E3NHU2Y> has recently started attending too, but not sure if she wants to keep her focus on the BlockSci side or span both? Others, including <@UMN7U5C8M> have provided important input at various times (especially at the start in Josh's case). So I'd suggest either expanding this list with regular participants who want to be named, or changing that heading to 'Regular Participants' or something along those lines?",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1714696755999589"
  },
  {
    "text": "We need a screen cap of the code and/or logs from the running service for the blue box and it’ll be all set!",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1714688644484999"
  },
  {
    "text": "FYI - I've updated this was a more recent version (under revisions review for Data for Policy 2024). It includes a table to help map LLM governance dimensions (oooooh), that might be helpful for thinking about where and how various subsets of 'the community' contributes to metaKOI-GPT\n\nNabben, Kelsie, AI as a Constituted System: Accountability Lessons from an LLM Experiment (September 1, 2023). Available at SSRN: <https://ssrn.com/abstract=4561433> or <http://dx.doi.org/10.2139/ssrn.4561433>",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1714618714241299"
  },
  {
    "text": "<@U04U7TN83CP> has joined the channel",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1713916066271349"
  },
  {
    "text": "<@U05MUBJ03AM> has joined the channel",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1713908777183609"
  },
  {
    "text": "I would love to have a landing page like to.community for koi, then describes alll the various planned research outcomes and lists the outputs. <@U01G7NSR78S> maybe you could get a GitHub pages going within the Metagov hosted repo?",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1713906153898729"
  },
  {
    "text": "all that to say i like it and it just got me thinking",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1713902913383659"
  },
  {
    "text": "KOI is essentially cultural or memetic body for a subpopulation. Along this line of thinking, it might be worth citing the politics of protocols piece -- or if you prefer to zoom out from metagov the knowledge networks piece. not that you are looking for lots of citations but as i am thinking about it the \"a language for knowledge networks\" (<https://blog.block.science/a-language-for-knowledge-networks/>) piece matches with that political ~ biological self-organization.",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1713902662786369"
  },
  {
    "text": "Deme's have you have described are subpopulations. if populations can be thought of as social networks, then demes are subgraphs (arguably clusters which are much more internally connected than they are externally connect, at least on average).",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1713902180403219"
  },
  {
    "text": "i like the term-- especially because of its similiary to the word \"meme\" -- based on the article its a kind of biological version of an interest group or solidaristic body with some persistent cultural infrastructure (aka institutions). its a more aggregate concept than meme its sort of a persistent body of memes :slightly_smiling_face:\n\ndoes that sound right?",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1713901583636479"
  },
  {
    "text": "i had to look up deme",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1713901138940359"
  },
  {
    "text": "Here's a draft of the thing I said I'd write (for <@UMN7U5C8M> to send to OpenAI). Any feedback before I press publish? <https://medium.com/@ellierennie/koi-pond-the-creation-of-a-synthetic-deme-999a6f1f3426>\nThe intention is to describe why KOI-Pond as an experiment is bigger than just Metagov.\nObviously people will have their own views on why this experiment matters - this is just my interest (not intended to be our position statement).",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1713884935889029"
  },
  {
    "text": "See our running doc for (very brief) first stage evaluation plan: <https://docs.google.com/document/d/1EORTXEK0veL73S6zfrbxMOOTkLTl82U1DOBHicGQrK0/edit#heading=h.whwzptz7gidm>",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1713473377450019"
  },
  {
    "text": "I've just made the RID repository that's going to powering KOI's knowledge base public, thought I'd share it here in case anyone is interested in checking it out. I wrote up some documentation in the readme that will hopefully explain some of the RID concepts a little more clearly! <https://github.com/BlockScience/kms-identity>",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1713203555733439"
  },
  {
    "text": "I won’t be able to make the call tn!",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1712843516557269"
  },
  {
    "text": "I've included my notes from last week's meeting in the <https://docs.google.com/document/d/1EORTXEK0veL73S6zfrbxMOOTkLTl82U1DOBHicGQrK0/edit#heading=h.kgolp0bb5c7q|Koi - Project Information> doc",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1712531776745959"
  },
  {
    "text": "<@U01672057BN> <@U02TV7DPGBG> There is a web interface developed as part of the goldfish project that will go live after this current phase of work. That includes a dedicated LLM chat page",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1712348560559099"
  },
  {
    "text": "<@U03AR5WH3QQ> has joined the channel",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1712328176212549"
  },
  {
    "text": "<@U06T0HLL5QC> has joined the channel",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1712305923147329"
  },
  {
    "text": "I could be in the wrong place <@U02TV7DPGBG> - I just searched OpenAI in my drive",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1712305852603539"
  },
  {
    "text": "I think the text is at the bottom of this doc - unless I’m reading the wrong thing ",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1712305682238099"
  },
  {
    "text": "<https://docs.google.com/document/d/1B2-VcZ23bx4NyWnyl7RDi7hF5-Pmt0wY80DfgbSZ6Pk/edit|https://docs.google.com/document/d/1B2-VcZ23bx4NyWnyl7RDi7hF5-Pmt0wY80DfgbSZ6Pk/edit>\n",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1712305650114959"
  },
  {
    "text": "Looks good! One question: Nick Vincent asked in the RD call if we’d consider looking at interfaces for the LLM other than in slack. He implied he’d be interested in working on that. Perhaps we say the first iteration is a chat bot in Slack and keep it a bit open as to whether it stays the interface? ",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1712305382368649"
  },
  {
    "text": "<@UMN7U5C8M> took a pass at the OpenAI proposal, feel free to edit or make some suggestions <@U01672057BN> might also be helpful for you to take a look!",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1712288437126459"
  },
  {
    "text": "For those not checking board channel, apparently we are fine to start ingesting/using govbase data with KOI as it’s cc by nc licence (which again raises the consequences of CC and open data in an org vs beyond org and whether KOI stretches the intention of that licence or not and how this eventually may be handled through RID system :sweat_smile:) ",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1712271594258809"
  },
  {
    "text": "FYI, Professor Jean Burgess, who is Brooke's other PhD supervisor (based at QUT in Brisbane) may be soon be lurking in this channel in order to get across the project for the purposes of helping Brooke with her ethnographic research - at my invitation. Metagov will have an opportunity to consent to the project very soon (as per RMIT's ethics process). As part of working through that ethics application, we decided this might be a good idea as I have a split role in ensuring Brooke's PhD is a happy journey and being active on the project itself. If that split-role gets too messy then Jean can press the big red button to reset whatever needs resetting. DM me if you have any questions/issues with this. (BTW, Jean's work is amazing: <https://www.admscentre.org.au/jean-burgess/>)",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1712202952143029"
  },
  {
    "text": "<@U01G7NSR78S> I have updated my draft website text. Is this accurate? \"KOI stands for Knowledge Organisation Infrastructure. Our KOI combines the technologies of a knowledge management system (KMS) and reference IDs (RID), resulting in a graph-based database to support relationships between knowledge objects, users and groups within Metagov. The KOI can be accessed by a large language model (LLM) as described here [link to BlockSci post].\" Full text here: <https://docs.google.com/document/d/1cYuBOHIM3WlpRz3uHL543B5OUOl-NFNeD3MVSuXXhnc/edit>",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1712116727549379"
  },
  {
    "text": "Apologies I'm very late to this thread -- thank you <@U04SDK8LGUX> for writing that up, that's a great summary of the current state of the project.\n\nAnother thing I wanted to add is that this research effort is broader than the LLM integration. The KOI in KOI Pond stands for Knowledge Organization Infrastructure, which the chat bot in <#C06LAQNLVNK|koi-tank> takes advantage of to give better answers based on Metagov knowledge, but this is just one possible integration to the infrastructure. Our current development is focused on building up the backend with graph based database infrastructure to support storing complex relationships between knowledge objects, users, and groups within Metagov. This will allows us to do things like weight the quality of knowledge sources utilized by the chat bot, automatically and manually observe new knowledge objects from all of the platforms Metagov is on, and scope access to different types of knowledge based on a user's relationship to the org. Once this initial transition is complete, we can begin adding more knowledge to the system.",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1712086376618999"
  },
  {
    "text": "Relevant application I found - looks similar to koi pond: <https://www.beloga.xyz/?ck_subscriber_id=1121221842>",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1711637910492899"
  },
  {
    "text": "I took a swing at some text for the webpage. <@U02TV7DPGBG> is this the kind of thing you are looking for? <https://docs.google.com/document/d/1cYuBOHIM3WlpRz3uHL543B5OUOl-NFNeD3MVSuXXhnc/edit>\n(I saved to our shared google drive folder, but let me know if it's not accessible).\nAnd please everyone jump in and edit! Credit to <@U040A3QQKB6> for 'library-a-thon' :heart:",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1711248679442949"
  },
  {
    "text": "Also, just noting here that <@U02TV7DPGBG> raised objections to the project and we haven't really talked those through or resolved them. Not sure if this an e/acc vs decel moment  or if it's just a response to our slowness on the non-technical aspects of the project. Cent, feel free to clarify now or not.",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1711065831999339"
  },
  {
    "text": "Maybe I need to accept that I am a subject in this ethnography (with Brooke and Keslie doing the observation) and just start designing and doing that governing thing you all talk about.",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1711062862626659"
  },
  {
    "text": "Reflection from today's meeting: A LARP to see emergent behaviours in relation to KOI would be a fun and hopefully productive thing to do. I support this. I'm just not sure yet whether I'd be involved in designing the LARP or be part of it (as ethnographer inside the LARP, as I was at the Black Swan event - I need to think about this). Other, more formal/structured ways of assessing KOI's change, use and challenges should also be explored, but we'd need researchers to propose those. Maybe we - as the team meeting to work on it regularly - just need a process for inviting people to design research of and using KOI? The ethnographic research is more meta research that would look at the practices and outcomes that result from undertaking research of various kinds (for instance, if we proceed with creative/games-based approaches to examining KOI does this change how it's perceived and used as opposed to doing very structured processes). An ethnography of a research community is different to reporting on the results of the research (although that is an important component). So if I seem hesitant to design an experiment/testing, it's partly because I'd like to see what emerges from metagov rather than from my own research planning/design processes. We do need to provide people with the opportunity to get involved and propose stuff, so the website is super important. How we describe possible research participation needs to be in there. Thanks for prompting us on this today, Cent!",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1711061899732719"
  },
  {
    "text": "Feedback thread for koi pond from today’s testing at the <#C0175M3GLSU|govbase-labs> meeting -&gt;",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1711056592332219"
  },
  {
    "text": "an interesting observation regarding LLMs and practices. I have found myself using the top end models from both OpenAI and Anthropic -- not independently but as part of a second opinion dynamic. I will often work with one as a kind of collaborator while I'm hashing through something, then use the other to evaluate the work. By switching between the models, i at least give myself the illusion of reducing bias injected into my thinking through working with the model to interrogate my ideas. Does anyone else do this?",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1710101911141959"
  },
  {
    "text": "<@U06LVP5NMHT> has joined the channel",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1709744546739529"
  },
  {
    "text": "How does the envisioned model cope with prioritization of retrieved info?",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1709314584518479"
  },
  {
    "text": "thought for after Denver - the RnDAO folks with Daniel Ospina are working on some LLM sense making tool within specific ecosystems (sounds like it might have some overlap with Koi Pond). Happy to set up a call with whoever would want to chat with them",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1709238049329949"
  },
  {
    "text": "<@U01G7NSR78S> courtesy of <@U02H58XP81W>",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1708975832318289"
  },
  {
    "text": "<@UMN7U5C8M> has joined the channel",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1708543324493009"
  },
  {
    "text": "I've set up a repo for development of tools related to data observation for the KOI pond project that can be accessed here: <https://github.com/metagov/kms-tools>\nThese aren't designed to be directly used by users at the moment, but to increase transparency of the data observation process as the project develops. Re: <@UMN7U5C8M> this is where Metagov specific components of the KMS system will be hosted!",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1708543321795409"
  },
  {
    "text": "<@U05S9QWLR1C> has joined the channel",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1708523035339119"
  },
  {
    "text": "We have real creative commons experts we can draw on for the IP question, including the inventor, so maybe we should line that up sometime",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1708047905573629"
  },
  {
    "text": "Reflection from today's meeting: <@U02TV7DPGBG> proposes/decides to make all Cent's posts ephemeral so they can't be ingested into the KOI, but <@UTER5GXFW> mentions that some BlockSci people started copying chats from personal DMs/channels into public channels as they wanted them to be included. Right now, Metagov has a lot of discussion about people's projects and myriad interesting thoughts on governance things happening out there in the world. I am curious to see if (and who) starts adding their longer-form written texts so that they are (kinda) creative commonsed to KOI's purview. (Side note - at the moment all of our seminars are publicly accessible but they are not repurposed for KOI's use so do we need some kind of agreement from people for that prior to them giving a seminar?) There are IP issues but it's exactly like creative commons in that the possible usefulness of what you do likely expands as it becomes accessible and picked up by KOI and then others. Particularly as KOI will tell people what sources it's drawing on. So you potentially get more exposure for your work/ideas by agreeing to contribute a knowledge object. And then this comes back to contribution goods (my area of research). Kealey and Ricketts wrote that theory specifically in relation to scientific societies. A contribution good differs from a club good in key ways, including that the membership can be open but the good becomes more valuable as more high quality contributors participate. Where am I going with this? Maybe KOI is about governing contribution goods. Thanks for coming to my TED talk.",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1708046504299549"
  },
  {
    "text": "<@U017E3NHU2Y> has joined the channel",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1708038363198129"
  },
  {
    "text": "<@U01MMPRM864> has joined the channel",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1708034382349059"
  },
  {
    "text": "<@U02H58XP81W> has joined the channel",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1708016220200319"
  },
  {
    "text": "KOI stands for Knowledge Organization Infrastructure, and it also plays nicely into a <https://en.wikipedia.org/wiki/Carp|carp>-based branding scheme. [Maybe goes without saying, but I'm not much at marketing.] At BlockScience, KOI is the research bucket that includes the development of KMS, or Knowledge Management System. More specific to <#C06DMGNV7E0|koi-pond>, it's a play on BlockScience's Project Goldfish.\n\nProject Goldfish moves BSci-KMS from being a PoC with an uptime reliability of 0.2 9s on a good day to a system that is operationally significant. The name alludes to the common result of first forays into fish-as-pet ownership, namely goldfish in a small bowl in which the fish dies, followed by an effort to provision a more sophisticated aquarium to serve as a home in which the next goldfish can grow and prosper.\n\nKOI Pond is an extension of this narrative alluding to the desire to create an ecosystem for many koi to grow and prosper. If goldfish at BSci is 0 --> 1, and koi at Metagov is 1 --> 2, then the goal is to get to many.",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1708006472683449"
  },
  {
    "text": "<@U01672057BN> has joined the channel",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1707973739557689"
  },
  {
    "text": "<@U06JQ5LAAUE> has joined the channel",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1707967155130119"
  },
  {
    "text": "<@U03SKJ260AV> has joined the channel",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1707954365315219"
  },
  {
    "text": "Hi,\nI made a langchain RAG using OpenAI's gpt3.5 on 169 regulatory mica/fatf documents, some perhaps 10000 pages I am familar with and it was depressingly not very engaging, even at different temperatures but very fast using my embedding db on local space.\nI then tried the new subscription preview gpt4 retrieval assistant api, unfortunately it only accepts 20 documents so I took the top ones, some 1000 pages and inference latency around 30 seconds, but in terms of quality, what a totally awesome experience.\n<@UTER5GXFW> - what is your experience so far with the KMS in terms of quality, speed and and validation of output?",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1707330432160159"
  },
  {
    "text": "<@U04GSACV2TG> has joined the channel",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1707209840881279"
  },
  {
    "text": "So far we’re just setting up a work space / discussion space. Though most of the work is coding / testing / devops type stuff at the moment so it’s not clear how active this chat will be initially.\n\nTo my knowledge Metagov does not have an org open AI subscription— that is something that still needs to be discussed with <@U01QS7HGP55>. For the purpose of development and testing <@U01G7NSR78S> can use an API key from BlockScience but once the Metagov instance goes live for the community Metagov should get its own account. This should be part of 2024 budget planning. \n\nFor questions regarding what you can and cannot submit reimbursements for — we don’t have a specific policy so I’d say you just need to ask <@U01QS7HGP55> and if he feels it’s necessary he can escalate to the <#C04FU2ZGTT9|board>.",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1705378905029269"
  },
  {
    "text": "<@U01QS7HGP55> has joined the channel",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1705012246759699"
  },
  {
    "text": "<@U01QS7HGP55> we've created this channel with intent to bridge it -- could you share it? i don't have the authority in this slack.",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1705012244112569"
  },
  {
    "text": "set the channel description: This channel is for research and development on the Metagov Knowledge Management and LLM interface development.",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1705012010508749"
  },
  {
    "text": "<@U0319V81YGY> has joined the channel",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1705011854253839"
  },
  {
    "text": "<@U04SDK8LGUX> has joined the channel",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1705011854158239"
  },
  {
    "text": "<@U01G7NSR78S> has joined the channel",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1705011854025269"
  },
  {
    "text": "<@UTER5GXFW> has joined the channel",
    "url": "https://metagov.slack.com/archives/C06DMGNV7E0/p1705011829301819"
  }
]